export const Regex = {
  NAME: /^([a-zA-Z ]+\s)*[a-zA-Z ]+$/,
  Title: /^([a-zA-Z]+\s)*[a-zA-Z]+$/,
  Intro: /^([a-zA-Z0-9 ]+\s)*[a-zA-Z0-9 ]+$/,
  COUNTRY: /[a-zA-Z]{2,}/,
  ZIP: /(^\d{6}$)|(^\d{6}-\d{5}$)/,
  Year: /(^\d{4}$)|(^\d{4}-\d{3}$)/,
  PHONE: /^[0-9]{3}([ -]?)[0-9]{3}([ -]?)[0-9]{4}$/,
  EMAIL_OR_PHONE: /^(?:\d{10}|\w+@\w+\.\w{2,3})$/,
  EMAIL:
    /^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/,
  PASSWORD:
    /^.*(?=.{8,})((?=.*[!@#$%^&*()\-_=+{};:,<.>]){1})(?=.*\d)((?=.*[a-z]){1})((?=.*[A-Z]){1}).*$/,

  post: /^([A-Z0-9 ]+\s)*[A-Z0-9 ]+$/,
  swiftcode: /^([A-Z0-9]+\s)*[A-Z0-9]+$/,
  Number: /^([0-9]+\s)*[0-9]+$/,
  RegNumber: /^([a-zA-Z0-9- ]+\s)*[a-zA-Z0-9- ]+$/,
  country_code: /^([0-9+]+\s)*[0-9+]+$/,
  SPECIAL_CHARACTERS:
    /^[a-zA-ZÀÂÉÊÈËÌÏÎÔÙÛÇÆŒàâéêèëìïîôùûçæœḍāśṣṣṇṁl̥ṅṅḍśāæē̥ṭñūīō' -]{3,100}$/,
  Registeration_number: /^[a-zA-Z0-9_/-]*$/,
  account_number : /^\S+\w{8,50}\S{1,}/,
};
